# LAB 32

## Part 1 : Python

In [43]:
import pandas as pd
import numpy as np
import sklearn
import category_encoders as ce
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
#sklearn.set_config(transform_output="pandas")

In [21]:
df = pd.DataFrame(columns = ["TransactionID", "ClientID","Profession", "Bank_dep", "Risk", "Number of credits", "Revenue"])

In [23]:
df

Empty DataFrame
Columns: [TransactionID, ClientID, Profession, Bank_dep, Risk, Number of credits, Revenue]
Index: []

In [76]:
data = {'TransactionID': [1,2,3,4,5],
      'ClientID': [231,765,453,231,892],
      'Profession': ['Self-employed','students','Horeca','self-employed','finance'],
      "Bank_dep" :['009','005','007','009','003'],
      'Risk': ['High','high','medium','high','low'],
      'Number of credits': [2,3,5,2,3],
      'Revenue': [30200,12700,89400,30200,740000]
      
        }

In [77]:
df = pd.DataFrame(data)

In [78]:
df

,TransactionID,ClientID,Profession,Bank_dep,Risk,Number of credits,Revenue
0,1,231,Self-employed,009,High,2,30200
1,2,765,students,005,high,3,12700
2,3,453,Horeca,007,medium,5,89400
3,4,231,self-employed,009,high,2,30200
4,5,892,finance,003,low,3,740000

In [97]:
#encoder = ce.BackwardDifferenceEncoder()
encoder = ce.BaseNEncoder()

In [98]:
#LabelEncoder().fit_transform(df['Profession'])
encoder.fit_transform(df['Profession'])

   Profession_0  Profession_1  Profession_2
0             0             0             1
1             0             1             0
2             0             1             1
3             1             0             0
4             1             0             1

In [99]:
try:
    encoder.fit_transform(df['Profession'])
except Exception as e:
    print(e)
encoder.fit_transform(df['Profession'].dropna())

   Profession_0  Profession_1  Profession_2
0             0             0             1
1             0             1             0
2             0             1             1
3             1             0             0
4             1             0             1

In [100]:
le = LabelEncoder()
le.fit(df['Profession'].dropna())
le.classes_

array(['Horeca', 'Self-employed', 'finance', 'self-employed', 'students'],
      dtype=object)

In [69]:
encoder = ce.BinaryEncoder()

In [70]:
encoder.fit_transform(df['Profession'])

   Profession_0  Profession_1  Profession_2
0             0             0             1
1             0             1             0
2             0             1             1
3             1             0             0
4             1             0             1

In [50]:

#X_cleaned = encoder.transform(X_dirty)